In [1]:
import pandas as pd
import numpy as np

In [2]:
# импорт из csv файла 
csv_zip = pd.read_csv('D:/Pandas_classes/train/train.csv')
csv_zip.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# импорт из exel 
excel_data = pd.read_excel('D:/Pandas_classes/train/iris.xlsx')
excel_data.head()

   Petal_width  Petal_length  Sepal_width  Sepal_length Species_name
0          0.2           1.4          3.5           5.1       Setosa
1          0.2           1.4          3.0           4.9       Setosa
2          0.2           1.3          3.2           4.7       Setosa
3          0.2           1.5          3.1           4.6       Setosa
4          0.2           1.4          3.6           5.0       Setosa

In [4]:
# импорт html
html_data = pd.read_html('https://en.wikipedia.org/wiki/World_population', match = 'World population')
len(html_data)

5

In [5]:
html_data[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1927,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",123,33,14,13,12,12,11,15,20

In [6]:
# импорт из SQL 
import sqlite3 as sql

# создадим соединение с базой данный chinook
conn = sql.connect('d:/Pandas_classes/train/chinook.db')

sql_data = pd.read_sql('SELECT * FROM tracks', conn)

sql_data.head()

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,None,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

In [7]:
# создание DataFrame из словаря
country = np.array(['China', 'Vietnam', 'United Kindom', 'Russia', 'Argentina', 'Bolivia', 'South Africa'])
capital = ['Beijing', 'Hanoi', 'London', 'Moscow', 'Buenos Aires', 'Sucre', 'Pretoria']
population = [1400, 97, 67, 144, 45, 12, 59]
area = [9.6, 0.3, 0.2, 17.1, 2.8, 1.1, 1.2]
sea = [1] * 5 + [0, 1]

countries_dict = {}
# превратим списки в значения словаря снабдив ключами
countries_dict['country'] = country
countries_dict['capital'] = capital
countries_dict['population'] = population
countries_dict['area'] = area
countries_dict['sea'] = sea

countries = pd.DataFrame(countries_dict)
countries

         country       capital  population  area  sea
0          China       Beijing        1400   9.6    1
1        Vietnam         Hanoi          97   0.3    1
2  United Kindom        London          67   0.2    1
3         Russia        Moscow         144  17.1    1
4      Argentina  Buenos Aires          45   2.8    1
5        Bolivia         Sucre          12   1.1    0
6   South Africa      Pretoria          59   1.2    1

In [8]:
# создание DataFrame из 2В массива
arr = np.array([[1, 1, 1],
                [2, 2, 2],
                [3, 3, 3]])

pd.DataFrame(arr)

   0  1  2
0  1  1  1
1  2  2  2
2  3  3  3

__Структура и свойства датафрейма__

In [9]:
# выведем столбцы датафрейма counties
countries.columns

Index(['country', 'capital', 'population', 'area', 'sea'], dtype='object')

In [10]:
# атрибут index описывает каким образом идентифицируются строки
countries.index

RangeIndex(start=0, stop=7, step=1)

In [11]:
# атрибут values позволяет получить доступ к значениям датафрейма
countries.values

array([['China', 'Beijing', 1400, 9.6, 1],
       ['Vietnam', 'Hanoi', 97, 0.3, 1],
       ['United Kindom', 'London', 67, 0.2, 1],
       ['Russia', 'Moscow', 144, 17.1, 1],
       ['Argentina', 'Buenos Aires', 45, 2.8, 1],
       ['Bolivia', 'Sucre', 12, 1.1, 0],
       ['South Africa', 'Pretoria', 59, 1.2, 1]], dtype=object)

In [12]:
# выведем описание индекса датафрейма через атрибут axes[0]
countries.axes[0]

RangeIndex(start=0, stop=7, step=1)

In [13]:
# axes[1] выводит названия столбцов
countries.axes[1]

Index(['country', 'capital', 'population', 'area', 'sea'], dtype='object')

__axis = 0__ - позволяет применить какой-либо метод к строкам датафрейма  
__axis = 1__ - позволяет применить какой-либо метод к столбцам датафрейма

In [14]:
# количество измерений
countries.ndim

2

In [15]:
# размерность
countries.shape

(7, 5)

In [16]:
# общее количество элементов
countries.size

35

In [17]:
# атрибут dtypes выдает тип данных каждого столбца
countries.dtypes

country        object
capital        object
population      int64
area          float64
sea             int64
dtype: object

In [18]:
# метод memory_usage() позволяет посмотреть объем занимаемой памяти по столбцам в байтах
countries.memory_usage()

Index         132
country        56
capital        56
population     56
area           56
sea            56
dtype: int64

__Индекс__  
По умолчанию при создании датафрейма библиотека Pandas снабжает его числовым индексом, который начинается с нуля. При этом мы можем присвоить датафрейму собственный индекс.

In [19]:
# присвоение индекса
custom_index = ['CN', 'VN', 'GB', 'RU', 'AR', 'BO', 'ZA']

countries = pd.DataFrame(countries_dict, index = custom_index)
countries

          country       capital  population  area  sea
CN          China       Beijing        1400   9.6    1
VN        Vietnam         Hanoi          97   0.3    1
GB  United Kindom        London          67   0.2    1
RU         Russia        Moscow         144  17.1    1
AR      Argentina  Buenos Aires          45   2.8    1
BO        Bolivia         Sucre          12   1.1    0
ZA   South Africa      Pretoria          59   1.2    1

In [20]:
# этот индекс можно сбросить с помощью metoda reset.index()
# параметр inplace = True сделает изменения постоянными

countries.reset_index(inplace = True)
countries

  index        country       capital  population  area  sea
0    CN          China       Beijing        1400   9.6    1
1    VN        Vietnam         Hanoi          97   0.3    1
2    GB  United Kindom        London          67   0.2    1
3    RU         Russia        Moscow         144  17.1    1
4    AR      Argentina  Buenos Aires          45   2.8    1
5    BO        Bolivia         Sucre          12   1.1    0
6    ZA   South Africa      Pretoria          59   1.2    1

In [21]:
# Снова сделаем этот столбец индексом с помощью метода .set_index().
countries.set_index('index', inplace = True)
countries

             country       capital  population  area  sea
index
CN             China       Beijing        1400   9.6    1
VN           Vietnam         Hanoi          97   0.3    1
GB     United Kindom        London          67   0.2    1
RU            Russia        Moscow         144  17.1    1
AR         Argentina  Buenos Aires          45   2.8    1
BO           Bolivia         Sucre          12   1.1    0
ZA      South Africa      Pretoria          59   1.2    1

In [22]:
# Еще раз сбросим индекс, но на этот раз не будем делать его отдельным столбцом. Для этого передадим методу .reset_index() параметр drop = True.
countries.reset_index(drop = True, inplace = True)
countries

         country       capital  population  area  sea
0          China       Beijing        1400   9.6    1
1        Vietnam         Hanoi          97   0.3    1
2  United Kindom        London          67   0.2    1
3         Russia        Moscow         144  17.1    1
4      Argentina  Buenos Aires          45   2.8    1
5        Bolivia         Sucre          12   1.1    0
6   South Africa      Pretoria          59   1.2    1

In [23]:
# собственный индекс можно создать просто поместив новые значения в атрибут index
countries.index = custom_index
countries

          country       capital  population  area  sea
CN          China       Beijing        1400   9.6    1
VN        Vietnam         Hanoi          97   0.3    1
GB  United Kindom        London          67   0.2    1
RU         Russia        Moscow         144  17.1    1
AR      Argentina  Buenos Aires          45   2.8    1
BO        Bolivia         Sucre          12   1.1    0
ZA   South Africa      Pretoria          59   1.2    1

__Многоуровневый индекс__  
Многоуровневый (MultiIndex) или иерархический (hierarchical) индекс позволяет задать несколько уровней (levels) для индексации строк или столбцов. «Внешний» индекс объединяет несколько элементов «внутреннего» индекса.

In [26]:
rows = [('Asia', 'CN'),
        ('Asia', 'VN'),
        ('Europe', 'GB'),
        ('Europe', 'RU'),
        ('S. America', 'AR'),
        ('S. America', 'BO'),
        ('Africa', 'ZA')]

cols = [('names', 'country'),
        ('names', 'capital'),
        ('data', 'population'),
        ('data', 'area'),
        ('data', 'sea')]

In [27]:
custom_multindex = pd.MultiIndex.from_tuples(rows, names = ['region', 'code'])

In [28]:
custom_multicols = pd.MultiIndex.from_tuples(cols)

In [29]:
countries.index = custom_multindex
countries.columns = custom_multicols
 
countries

                         names                     data
                       country       capital population  area sea
region     code
Asia       CN            China       Beijing       1400   9.6   1
           VN          Vietnam         Hanoi         97   0.3   1
Europe     GB    United Kindom        London         67   0.2   1
           RU           Russia        Moscow        144  17.1   1
S. America AR        Argentina  Buenos Aires         45   2.8   1
           BO          Bolivia         Sucre         12   1.1   0
Africa     ZA     South Africa      Pretoria         59   1.2   1